departments = ["应用语言系", "电大联办点", "计算机工程系", "建筑工程系", "机电工程系",
               "传媒艺术系", "电子工程系", "商贸管理系", "机械工程系", "自动化工程系"]

yyyy = ['商务英语1511', '休闲服务1711', '文秘0611', '商务英语0431', '旅游管理1431', '网络编辑0911', '网络编辑1711', '网络编辑1211', '商务英语0332',
        '网络编辑1011', '商务英语1311', '商务英语1312', '商务英语0811', '商务英语0912', '商务英语0531', '文秘0811', '网络编辑1411', '商务英语0713',
        '涉外旅游1512', '文秘1011', '商务英语0611', '涉外旅游1411', '网络编辑1512', '商务英语1112', '商务英语1011', '商务英语1211', '商务英语024',
        '商务英语0711', '涉外旅游1311', '文秘1111', '旅游管理1712', '涉外旅游1291', '商务英语1711', '商外022', '商务英语1012', '文秘0911', '涉外旅游1312',
        '商务英语0812', '网络编辑1511', '旅游管理1611', '商务英语1611', '网络编辑1612', '乘务管理1711', '网络编辑1311', '网络编辑1611', '商务英语0512',
        '旅游管理1711', '网络编辑1111', '文秘0711', '涉外旅游1111', '商务英语1411', '旅游管理1432', '商务英语0511', '商务英语1111', '网络编辑1012',
        '文秘021', '涉外旅游1511', '商务英语0911', '网络编辑1412', '商务英语1512', '旅游管理021', '旅游管理1612', '涉外旅游1211', '商务英语0331', '商外021',
        '商务英语0712']

ddlb = ['通信16-1', '电气16-1', '电子16-1', '机电16-1']

jsjgc = ['网络信息1211', '系统维护1111', '可视化0231', '系统维护0921', 'WEB0632', '软件技术1611', '网络信息1131', '软件技术1111', '系统维护1411',
         '03网络', '02网络1', '物联网1112', 'WEB0522',   '网络技术1512', '网络技术1412', 'WEB0232', '网络管理0431', 11321,
         11322, '计算机类1211',  '物联网1511',  '物联网1711', '数据库0811', '网络技术1411', 11341, '可视化0611', '数据库0331',
         '移动互联1712', 'WEB0631', '计算机类1112', '可视化0331', '网络信息1411', 'WEB0332', '物联网1111', '软件技术1512', '信息技术1511',
         '软件技术1612', '计算机类1213', '网络管理0332', '网络管理0511', '网络信息0911', '系统维护1512', '网络技术1511', 'WEB0334', 'WEB0432',
         '移动互联1611', '软件技术1112', '02网络4', '可视化0322', '系统与维护1611', '网络信息0912', '网络技术0811', '网络技术1111', '系统维护1121',
         '数据库0321', '网络技术1012', '可视化0411', '02网络3', '系统维护0812', '物联网1612', 'WEB0411', '网络管理0531', '计算机类1212', '物联网1211',
         '软件技术1411', '数据库0421', '微机022', '系统维护1131', '可视化0721', 'WEB0531', '网络技术1712', '系统维护1211', '微机021', '网络技术0812',
         '计算机类1111', '软件技术1212', '软件技术0911', '网络技术1611', '网络技术1211', '可视化0311', '网络技术1721', '网络技术1011', 1311, 1312,
         '网络技术0913', '网络信息1011' '网络信息1111', '系统维护0911', '系统维护1011', '系统维护1511',
         '信息技术1331', 'WEB0532', '系统维护1412', '网络信息0711', '软件技术1012', '软件技术1311', '软件技术1511', '网络技术1312',
          '网络信息1311',  '网络构建0711',  '网络管理0331', '数据库0311', '系统与维护1711', '可视化0321', '信息技术1231',
         '可视化0421', '系统维护1271', '智能应用1431', '软件技术1312',  '网络管理0411', '物联网1712', 'WEB0331', '网络信息1012', '软件技术1412',
         'WEB0431', '软件技术1712', '系统维护1321', '数据库0411', '网络信息0611', '网络技术1711', '网络技术1513', '网络信息0712', '网络技术0912',
         '物联网1411', '移动互联1711', '网络信息0511', '计算机类1113', '物联网1611', '系统维护0811', '系统与维护1612', '物联网1311', '网络技术1311',
         '网络构建0331', '网络构建0521', '网络技术1612', '软件技术1711', '可视化0511', '计算机控制1011', '02网络2', '软件技术1011', '网络技术0911',
         '软件技术1211', '网络构建0411', 'WEB0721', '计算机类1114', '微机023', 'WEB0231', '系统维护1021', '网络信息0811', 'WEB0521']

jzgc = ['工程管理类1216', '建筑工程1114', '地籍测绘1511', '工程管理类1316', '建筑工程1611', '工民建0361', '建筑工程1115', '建筑装饰1412', '房屋建筑0412',
        '工程管理类1113', '房屋建筑0532', '地测0811', '工程造价1512', '土建施工类1313', '建筑工程1011', '土建施工类1216', '基础工程1011', '工程造价1313',
        '工测0231', '工程造价1012', '工测0331', '房建0431', '基础工程1311', '土建施工类1311', '建筑工程1413', '建筑装饰1611', '工程造价1213', '建工0711',
        '建筑工程1112', '土建施工类1115', '工程造价1014', '基础工程0811', '工程监理1111', '工程造价1211', '建筑工程1411', '建筑工程1316', '工程管理类1112',
        '工程管理类1215', '地籍测绘1111', '地籍测绘1711', '造价0711', '工程造价1113', '地测0711', '基础工程0911', '工程管理类1314', '工程管理类1313',
        '工民建0261', '建筑工程1612', '工程造价1212', '工程管理类1315', '工程造价1011', '地籍测绘1411', '土建施工类1111', '土建施工类1114', '工程监理1211',
        '工程造价1511', '工程监理1411', '工程造价1613', '工程造价0811', '建筑工程1013', '工程造价0412', '建筑工程1131', '地籍测绘1211', '建筑工程1312',
        '土建施工类1213', '建筑工程1712', '工程管理类1111', '工程管理类1212', '房建0311', '建筑工程0632', '土建施工类1113', '工程造价1115', '地籍测绘1611',
        '工程造价1614', '建筑工程1111', '工程造价0812', '基础工程1111', '房建0432', '建筑装饰1211', '建筑装饰1311', '建筑工程1012', '建筑工程0812',
        '土建施工类1116', '建筑工程1231', '房建0331', '土建施工类1312', '工程造价1414', '造价0261', '工程造价1214', '工程管理类1214', '建筑工程1213',
        '建筑工程1431', '建筑工程1311', '地籍测绘1311', '建筑工程1211', '工程造价0331', '工程造价1412', '工程造价1711', '造价0511', '工程造价1114',
        '房建0131', '建筑工程1215', '地籍测绘1012', '工程管理类1211', '建工0713', '工程管理类1311', '房屋建筑0411', '建筑工程0912', '建筑工程0631',
        '工程造价1411', '房建0511', '房建0231', '建筑工程1331', '建筑装饰1212', '工程造价1216', '工程造价0912', '土建施工类1315', '工程管理类1115',
        '工程管理类1114', '基础工程1411', '建筑工程1314', '建筑工程1315', '建筑装饰1711', '建工0712', '建筑工程1711', '建筑工程1415', '造价0512',
        '建筑工程1313', '隧道工程1611', '工程造价1215', '工程造价1712', '工程造价1612', '房建0312', '工程造价0911', '建筑装饰1312', '建筑工程1113',
        '土建施工类1215', '工测0131', '土建施工类1214', '建筑工程1512', '建筑工程0911', '工测0261', '土建施工类1314', '工程造价1112', '工民建0262',
        '基础工程1511', '工程造价1316', '工程造价0411', '建筑工程1414', '建筑工程1214', '建筑工程1412', '工程监理1711', '工程造价1013', '地籍测绘0911',
        '环保0261', '土建施工类1316', '工程管理类1312', '工程造价1415', '建筑工程0811', '工程造价1312', '建筑工程1511', '工程监理1611', '工程监理1311',
        '房屋建筑0531', '建筑装饰1411', '工程监理1511', '建筑工程1212', '工程造价1713', '土建施工类1112', '造价0611', '建筑工程1216', '地籍测绘1011',
        '工程造价1314', '工程造价1413', '房建0512', '资源0261', '建筑工程1613', '工程造价1315', '工程造价1311', '工程管理类1213', '建筑装饰1511',
        '房建0611', '路桥0131', '路桥0231', '路桥0261', '工程造价1611', '隧道工程1711', '土建施工类1212', '装饰0261', '工程造价1111', '土建施工类1211']

jdgc = ['设计制造1211', '模具0331', '数控0511', '数控技术1512', '设计制造1311', '数控0712', '机械制造类1211', '数控1012', '模具设计1191', '模具0314',
        '模具0812', '数控0811', '机械制造类1213', '模具设计1411', '自动化类1112', '模具0811', '数控技术1121', '模具设计1211', '模具0421', '模具设计1513',
        '模具0311', '模具0531', '数控0311', '模具0721', '模具设计1512', '自动化类1212', '数控技术1511', '数控0411', '机械制造类1111', '数控0631',
        '模具设计1321', '模具设计1271', '设计制造1111', '模具0412', 1221, 1222, '模具设计1291', '数控技术1211', '模具设计1412', '数控1111',
        '设计制造1011', 21221, 21222, '模具设计1611', '模具0921', 1261, 1262, '数控0413', '模具0431', '机械制造类1114', '数控技术1312',
        '机械制造类1112', '模具设计1511', '数控技术1411', 21261, '模具0411', '数控技术1331', '模具0522', '设计制造0811', '模具设计1312', '模具0611',
        '模具0512', '数控1011', '模具0712', '数控0911', '模具0912', '模具0521', '模具1012', '模具设计1112', '数控1021', '模具0913',
        '数控技术1611', '数控0611', '数控0711', '数控0331', '模具设计1612', '数控0512', '模具0911', '机械制造类1212', '模具0312', '模具0511',
        '自动化类1211', '材料成型(信息)1301', '自动化类1213', '机械制造1611', '数控0431', '模具0711', '模具1011', '设计制造0911', '数控技术1311',
        '机械制造类1113', 11211, '数控0531', '工业设计1411', '模具0813', 11221, '模具设计1111', '模具0313', '模具设计1311', '数控0412']

cmys = ['影视动画1711', '数字媒体1412', '广告0711', '室内设计1711', '广告设计1411', '影视动画1012', '广告装潢0321', '广告设计1311', '数字媒体1311',
        '广告设计1513', '图形图像0711', '广告设计1712', '数字媒体1711', '图形图像0431', '艺术设计类1111', '图形图像0411', '影视动画1612', '数字媒体0911',
        '广告设计1312', '图形图像0633', '广告0512', '广告设计1111', '艺术设计类1112', '数字媒体1512', '艺术1211', '广告设计0911', '影视动画0813',
        '广告设计1412', '广告设计1012', '数字媒体1011', '广告设计1711', '影视动画0812', '广告0511', '影视动画1411', '影视动画0911', '广告设计1112',
        '广告021', '广告设计1612', '数字媒体1712', '影视动画1511', '影视动画0811', '影视动画1011', '广告0611', '广告0331', '数字媒体1511', '影视动画1211',
        '广告设计1512', '图形图像0632', '图形图像0631', '广告设计1011', '影视0711', '影视动画1112', '艺术设计类1113', '图形图像0331', '影视动画1412',
        '数字媒体1611', '影视动画1311', '数字媒体1411', '数字媒体1111', '广告0811', '影视动画1512', '影视动画1611', '广告设计1511', '影视动画1712',
        '影视动画1111', '广告装潢0411', '广告设计1611']

dzgc = ['楼宇智能1311', '通信0521', '通信技术1231', '通信技术1431', '电子信息1412', '电子信息1612', '通信0411', '电子信息1221', '通信0611',
        '电子信息0811', '电子信息1711', '光电技术1711', '通信技术1411', '电子信息1413', '电子信息1131', '通信技术0911', '通信技术1432', '通信技术1512',
        '电子0332', '电子信息1011', '广电0711', '通信工程1711', '通信技术1332', '电子信息1321', '通信技术1412', '通信技术1112', '通信0431',
        '电子信息1512', '通信技术1211', '通信0512', '电子信息1111', '电子信息1121', '夏新班', '通信0421', '通信技术1612',
        '电子信息0812', '电子信息类1112', '楼宇智能1511', '通信技术1012', '智能0611', '光电子0913',
        '通信技术1013', '电子信息1021',  '光电子0911', '通信0331', '电子0522', '通信技术1212', '通信0413', '光电子1511',
        '电子0711', '通信技术1712', '电子信息0912', '通信技术1111', 21151, '电子信息类1114', '电子信息1211', '电子0413', 21171, '电子信息0822',
        '通信0712', '电子信息1721', '通信技术1711', '通信0711', '电子信息1222', '电子(信息)1301', '通信1641', '智能电子1012', '电子信息1712',
        '通信技术1312', '光电子1211', '电子0531', '电子信息1012', '电子0331', '建筑智能1741', '电子信息1311', '智能电子1211', '光电子0912',
        '通信技术1331', '高职011', '光电子1011', '电子0521', '电子0712', '智能电子0811', '电子信息0922', '电子信息1322', '电子信息0923', '电子0421',
        '电子信息类1113', '智能电子0911', '电子0312', '通信0321', '通信技术1713', '光电子1012', '光电子1111', '电子0611', '电子信息0821', '建筑智能1711',
        '光电技术1611', '高职021', '电子信息0921', '电子0512', '电子0314', '建筑智能1611', '通信技术0912', '电子信息0631', '通信0412', '通信技术0811',
        '通信技术1311', '电子0411', '智能电子1011', 11141, 11142, 11143, '电子信息1513', '光电子1311', '通信技术1221', 11151, 11152, '家电021',
        '电子0511', '智能0711', '广播电视0811', '通信技术1611', '电子信息1212', '电子0412', '电子0231', '电子信息类1111', '通信技术1131', 11171,
        11172, '电子信息1511', '电子0313', '智能电子1112', 11181, '电子信息0911', '通信0511', '通信技术1413', '通信技术1511', '光电子1411',
        '电子信息1611', '智能0511', '通信工程1611', '电子0432', '通信技术1011', '电子信息1312', '电子信息1411', '电子信息1613', '智能电子1111',
        '电子0311', '电子0431', '电子0721']

smgl = ['电子商务0311', '会计1712', '物管0711', '国际贸易0911', '电子商务0412', '会计031', '会计1514', '涉外会计0612', '07永辉班', '物流管理1711',
        '物流管理1611', '会计0711', '国际贸易1511', '涉外会计1311', '涉外会计1314', '会计1721', '物流管理1612', '会计1711', '电子商务1212', '会计1511',
        '物流管理1712', '连锁经营0912', '涉外会计1212', '电子商务1611', '会计021', '国际贸易0511', '电子商务0711', '连锁经营1012', '涉外会计1211',
        '涉外会计0411', '物流管理1211', '电子商务1291', '涉外会计0521', '会计0721', '物流管理0512', '电子商务0332', '连锁经营1411', '电子商务1312',
        '连锁经营1711', '电子商务1311', '物流管理1512', '涉外会计0311', '连锁经营1712', '国际贸易1211', '涉外会计0412', '连锁经营1011', '连锁经营1611',
        '会计1413', '电子商务1721', '涉外会计1021', '电子商务1012', '涉外会计0511', '涉外会计1111', '电子商务021', '电子商务0521', '涉外会计0421',
        '连锁经营1512', '会计022', '物流管理0911', '会计1713', 11431, 11432, '电子商务0313', '电子商务1612', '会计1621', '涉外会计1121',
        '电子商务1591', '国贸0711', '国贸0712', '涉外会计0321', '连锁经营1112', '涉外会计0512', '国际贸易1311', '电子商务1011', '国际贸易0331',
        '物流管理0611', '连锁经营0911', '连锁经营1412', '连锁经营1111', '会计1411', '涉外会计1011', '会计1412', '物流管理1011', '物流管理0331',
        '电子商务0411', '国际贸易0412', '电子商务0811', '电子商务0911', '电子商务1191', '涉外会计1313', '06永辉班', '涉外会计1271', '物流管理1311',
        '物流管理1212', '涉外会计0811', '电子商务1412', '电子商务1292', '电子商务1211', '涉外会计0912', '连锁经营1312', '电子商务1511', '物流管理0812',
        '国际贸易1611', '涉外会计1213', '物流管理1111', '经营管理0811', '电子商务1413', '物流管理0511', '电子商务0312', '连锁经营1211', '电子商务1613',
        '物流管理1511', '连锁经营1213', '连锁经营1612', '国际贸易0321', '连锁经营1212', '电子商务1712', '电子商务024', '涉外会计0921', '连锁经营1311',
        '电子商务0912', '会计1611', '经营管理0812', '会计1512', '物流管理1411', '国际贸易0611', '电子商务0913', '涉外会计0822', '涉外会计0312',
        '涉外会计0911', '涉外会计1321', '涉外会计1012', '电子商务1713', '电子商务1512', '电子商务0331', '电子商务1313', '会计1513', '国际贸易0811',
        '营销021', '国际贸易0411', '国际贸易1711', '国际贸易1411', '连锁经营1741', '物流管理0631', '涉外会计10用友订单班', '涉外会计1112', '电子商务1111',
        '电子商务0511', '涉外会计0821', '物流管理0811', '涉外会计1312', '会计1421', '物管0712', '连锁经营1511', '电子商务1411', '电子商务0522',
        '会计1612', '电子商务022', '国际贸易1111', '电子商务1013', '会计1613', '电子商务1711', '国际贸易1011', '电子商务0611', '涉外会计0611',
        '涉外会计0522', '会计1414']

jxgc = ['数控技术1431', '机械制造1712', '机械制造1711', '模具设计1711', '数控技术1711']

zdhgc = ['机电1612', '机电1011', '电气1611', '机电0911', '机电0411', '机电1512', '机电1412', '机电1311', '机电1012', '机电1511', '机电0711',
         '机电0812', '电气1011', '电气1111', '电气0911', '机电1212', '电气1411', '机电1211', '机电0811', '电气1612', '机电1711', '电气1412',
         '机电0712', '机电1312', '电气1211', '机电1111', '电气1711', '电气1311', '机电1411', '机电1112', '机电1712', '电气1712', '电气1511',
         '机电0511', '机电1513', '电气1512', '机电1611', '机电0912']

all = [yyyy, ddlb, jsjgc, jzgc, jdgc, cmys, dzgc, smgl, jxgc, zdhgc]
sum = 0
for i in all:
    sum += len(i)
print(sum)
